import Translator from "./translator.js";

// let isNodeJS = typeof window === 'undefined'
// if (isNodeJS) {
//     globalThis.fetch = (await import("node-fetch")).default;
//     globalThis.Headers = (await import("node-fetch")).Headers;
// }
function Gpt() {
    this.cache = {};
}

Gpt.prototype.chatCompletion = async function(messages) {
    let myHeaders = new Headers();
    myHeaders.append("Content-Type", "application/json");
    myHeaders.append("Authorization", "Bearer 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");

    let raw = JSON.stringify({
        "model": "gpt-3.5-turbo",
        "messages": messages,
        // "max_tokens": 64,
        "temperature": 0
    });

    let requestOptions = {
        method: 'POST',
        headers: myHeaders,
        body: raw,
    };

    const response = await  fetch("https://api.openai.com/v1/chat/completions", requestOptions)
    if (response.status != 200) {
        throw new Error(`Chat Completion Error response status: ${response.status}: ${response.statusText}`);
    }
    let respBody = await response.json();
    let respMessage = respBody.choices[0].message;
    return respMessage;
}

Gpt.prototype.translateText = async function(s) {
    let messages = [
        {
            "role": "system",
            "content": "You are a professional translation engine. You produce accurate and elegant translations, not in the style of machine translations. You do not interpret, only translate. You translate the meaning fully, you do not summarize. You preserve newline characters without removing them. You check after translating to ensure the number of newline characters and their position match exactly in the original text and translation. "
        },
        // {
        //     "role": "user",
        //     "content": `Professionally translate the following text from Arabic to English and keep all whitespace intact. After translating, make sure all newline characters in the original text and translation are identical.: ${s}`
        // }
        // {
        //     "role": "user",
        //     "content": `Professionally translate the following text from Arabic to English. For every occurrence of "|" in the original text, leave it untouched.
        //     After translating, check the translation to ensure all occurrences of "|" from the original text are present in the translation, insert "|" characters into the translation if any are missing.: ${s}`
        // },
        // {
        //     "role": "user",
        //     "content": `Professionally translate the following text from Arabic to English. After translating, make sure newline characters are identical in the translation and original text, insert "\n" into the translation if necessary to guarantee this. : ${s}`
        // },
        {
            "role": "user",
            "content": `Translate the following text from Arabic to English: ${s}`
        }
    ]

    let assistantMessage = await this.chatCompletion(messages);
    return assistantMessage.content;
}

Gpt.prototype.getSentences = function(p) {
    let endPunc = [".", "!", "؟"];
    let sList = [];
    let i = 0, j = 0;
    while (j < p.length) {
        i = j; j++;
        while (j < p.length && !endPunc.includes(p[j])) {
            j++;
        }
        if (j < p.length)
            j++;

        if (j < p.length && p[j] == "»")
            j++;

        sList.push(p.slice(i, j).trim());
    }

    // let sList2 = [];
    // for (let i = 0; i < sList.length-1; i++) {
    //     if (sList[i].length <= 15 && sList2.length > 0) {
    //         sList2[sList2.length-1] += sList[i];
    //         continue;
    //     }
    //     sList2.push(sList[i]);
    // }

    return sList;
}

Gpt.prototype.translateSentenceInParagraph = async function(s, p) {
    p = p.replace(/[\n\t]/g, "");
    p = p.replace(/ +/g, " ").trim();

    s = s.replace(/[\n\t]/g, "");
    s = s.replace(/ +/g, " ").trim();

    if (this.cache.hasOwnProperty(s))
        return this.cache[s];

    let sList = this.getSentences(p);
    if (!sList.includes(s)) {
        throw new Error(`Gpt trans s not in sList: ${sList} ${s}`);
    }

    await this.translateParagraph(p);

    return this.cache[s];
}

Gpt.prototype.translateParagraph = async function(p) {
    p = p.replace(/[\n\t]/g, "");
    p = p.replace(/ +/g, " ").trim();

    let sList = this.getSentences(p);


    for (let i = 0; i < sList.length; i += 3) {
        try {
            await this.translateSList(sList.slice(i, i+3));
        } catch {
            console.log("Trans length mismatch, trying sequential");
            let prevContext = null;
            if (i >= 3) {
                prevContext = sList.slice(i-3, i);
            }
            await this.translateSListIndividually(sList.slice(i, i+3), prevContext);
        }
    }
}

Gpt.prototype.translateSListIndividually = async function(sList, prevContext = null) {
    let messages = [
        {"role": "system", "content": "You are a professional translation engine that translates from Arabic to English." +
                " You  produce elegant, eloquent translations. You translate text fully, you do not summarize. You only translate, you never interpret.:"}
    ];
    if (prevContext != null) {
        for (let i = 0; i < prevContext.length; i++) {
            messages.push({"role": "user", "content": prevContext[i]});
            messages.push({"role": "assistant", "content": this.cache[prevContext[i]]});
        }
    }
    for (let i = 0; i < sList.length; i++) {
        messages.push({"role": "user", "content": sList[i]});
        let assistantMessage = await this.chatCompletion(messages);
        messages.push(assistantMessage);

        this.cache[sList[i]] = assistantMessage.content;
    }

    let t = sList.map(x => this.cache[x]).join("\n");
    return t;
}

Gpt.prototype.translateSList = async function(sList) {
    let modS = sList.join("\n\n");

    let t = await this.translateText(modS);
    let tList = t.split(/\n+/g);

    if (sList.length != tList.length) {
        throw new Error(`Gpt trans sList.length != tList.length: ${sList} ${tList}`);
    }

    for (let i = 0; i < sList.length; i++) {
        this.cache[sList[i]] = tList[i];
    }

    console.log(t);

    return t;
}

Gpt.prototype.translateSentenceInElement = async function(s, el)  {
    let p = el.textContent;
    let nextP = "";
    while (p.length + nextP.length < 1000) {
        p += nextP;
        el = el.nextSibling;
        if (el == null || el.tagName != "P")
            break;
        nextP = el.textContent;
    }

    return await this.translateSentenceInParagraph(s, p);
}

export default Gpt;

// let gpt = new Gpt();
//
// let chap = "وَانْتَهى بِها الْمَطافُ إِلى غُرْفَةِ الغُسْلِ الصَّغِيرَةِ، فَبَصْبَصَتْ (حَرَّكَتْ ذنَبها) مَسْرُورَةً بِتَوْفِيقِها، وَرَفَعَتْ عَيْنَيْها إِلى صُنْدُوقٍ فَوْقَ الرَّفِّ، ثُمَّ حَيَّتْ صَديقَتَها مُبْتَهِجَةً، قائِلَةً: «سُعِدَ يَوْمُكِ يا «أُمَّ خِداشَ». لَقَدْ ساوَرَنِي الْقَلَقُ عَلَيْكِ، فَماذا أَخَّرَكِ عَنْ تَحِيَّةِ صَدِيقَتِكِ؟ وَماذا تَصْنَعِينَ فَوْقَ هذا الرَّفِّ الْعالِي؟»\n" +
//     "\n" +
//     "\n" +
//     "فَقالَتْ «أُمُّ خِداشَ»: «إِنِّي مُفْضِيَةٌ إِلَيْكِ بِأَمْرٍ يَدْعُو إِلى الدَّهْشَةِ وَالْعَجَبِ: لَقَدْ فُوجِئْتُ مُفاجَآتٍ خَمْسًا، وَرَأَيْتُ غَرائِبَ خَمْسًا …!»\n" +
//     "فَلَمْ تَفْهَمْ «أُمُّ يَعْفُورَ» شَيْئًا مِمَّا تَعْنِيهِ، وَرَفَعَتْ فاها فِي الْهَواءِ وَهِيَ حائِرَةٌ، فَسَمِعَتْ صَوْتَ طِفْلٍ صَغِيرٍ يَنْبَعِثُ فَجْأَةً مِنَ الصُّنْدُوقِ مُجَمْجِمًا: «مِيا … وْ! مِيا … وْ! أُمَّاهُ!»"
//
// // let test = "فَلَمْ تَفْهَمْ «أُمُّ يَعْفُورَ» شَيْئًا مِمَّا تَعْنِيهِ، وَرَفَعَتْ فاها فِي الْهَواءِ وَهِيَ حائِرَةٌ، فَسَمِعَتْ صَوْتَ طِفْلٍ صَغِيرٍ يَنْبَعِثُ فَجْأَةً مِنَ الصُّنْدُوقِ مُجَمْجِمًا: «مِيا … وْ! مِيا … وْ! أُمَّاهُ!»"
// // gpt.getSentences(test);
//
// let chapAll = "كانَتْ «أُمُّ يَعْفُورَ» وَ«أُمُّ خِداشَ» صَدِيقَتَيْنِ حَمِيْمَيْنِ. وكانَتْ كِلْتاهُما تُحِبُّ الْأُخْرَى، وتُخْلِصُ لها، وتَمْحَضُها الوُدَّ، ولا تَأْلو جُهْدًا فِي إِرْضائِها، وَلا تَضَنُّ عَلَيْها بِعَزِيزٍ وَلا غالٍ، وَلا تُخْفِي عَنْها شَيْئًا مِنْ أَسْرارِها. وَكانَتا تَأْكُلانِ — مَعًا — مِنْ صَحْفَةٍ واحِدَةٍ (طَبَقٍ واحِدٍ)، وَتَعِيشانِ فِي بَيْتٍ واحِدٍ. وَقَدْ نشَأَتا وَتَرَعْرَعَتا وَشَبَّتا مُتَحالِفَتَيْنِ عَلَى الْوَفاءِ وَالْحُبِّ.\n" +
//     "أَمَّا «أُمُّ يَعْفُورَ» فَهِيَ كَلْبَةٌ صَغِيرَةٌ جِدًّا، وَهِيَ ظَرِيفَةٌ صَفْراءُ الْإِهابِ (الْجِلْدِ)، أَنِيقَةُ الْجِلْبابِ.\n" +
//     "\n" +
//     "\n" +
//     "وَأَمَّا صَدِيقَتُها «أُمُّ خِداشَ» فَقِطَّةٌ كَبِيرَةٌ، ذاتُ شَعْرٍ حَرِيرِيٍّ، وَلَها ذَنَبٌ يُغَطِّيهِ الشَّعْرُ الْكَثِيفُ.\n" +
//     "وَفي ذاتِ يَوْمٍ احْتَجَبَتْ «أُمُّ خِداشَ» عَنْ صَدِيقَتِها، ولَمْ تَأْتِ لِتَحِيَّتِها، عَلَى عادَتِها. وَبَحَثَتْ «أُمُّ يَعْفُورَ» في سَلَّةِ «أُمِّ خِداشَ» الَّتي أَلِفَتِ الرُّقادَ فيها، فلَمْ تَعْثُرْ لَها على أَثَرٍ. فَحارَتْ «أُمُّ يَعْفُورَ»، ولم تَدْرِ سِرَّ احْتِجابِ صديقتِها العزِيزَةِ، وخشِيَتْ أن يكونَ قد ألَمَّ بها طائِفُ سُوءٍ.\n" +
//     "فَقالتْ «أُمُّ يَعْفُورَ» الوفيَّةُ: «إِنَّ هذا الْحَساءَ لا يزالُ غاليًا (شَديدَ الحرارَةِ)؛ فَلْأَصْبِرْ قَلِيلًا، حَتَّى يَبْرُدَ، لعلَّ صديقتي «أُمَّ خِداشَ» تأْتي لِتَشْرَكَنِي فِي الطَّعامِ.»\n" +
//     "ثُمَّ جَلَسَتْ «أُمُّ يَعْفُورَ» عَلَى رِجْلَيْها الْخَلْفِيَّتَيْنِ، وظلَّتْ تَسْتَنْشِقُ بُخارَ الْحَساءِ المُتَصاعِدَ بفِيها الأَسْوَدِ، وتَتَأَمَّلُ في الصَّحْفَةِ، وَهِيَ تَقُوُلُ لنَفْسِها: «لَقَدْ ذَكَرْتُ الْآنَ كُلَّ شَيْءٍ! فَإِنَّ «أُمَّ خِداشَ» أَخْبَرَتْنِي ذاتَ يَوْمٍ أَنَّها سَتُفاجِئُنِي — بَعْدَ أَيَّامٍ قَلائِلَ — مُفاجَأَةً مُدْهِشَةً. فَيا لَيتَ شِعْرِي: أَيَّةُ مُفاجَأَةٍ أَعَدَّتْها لِي؟»\n" +
//     "وَاشْتَدَّ ﺑ«أُمِّ يَعْفُورَ» الْقَلَقُ، فَسارَتْ حائِرَةً تَبْحَثُ عَنْ صاحِبَتِها فِي كُلِّ مَكانٍ، وَتَشَمُّ أَرْكانَ الْبَيْتِ وَمَخابِئَهُ، عَلَّها تَهْتَدِي إِلَيْها.\n" +
//     "\n" +
//     "\n" +
//     "وَانْتَهى بِها الْمَطافُ إِلى غُرْفَةِ الغُسْلِ الصَّغِيرَةِ، فَبَصْبَصَتْ (حَرَّكَتْ ذنَبها) مَسْرُورَةً بِتَوْفِيقِها، وَرَفَعَتْ عَيْنَيْها إِلى صُنْدُوقٍ فَوْقَ الرَّفِّ، ثُمَّ حَيَّتْ صَديقَتَها مُبْتَهِجَةً، قائِلَةً: «سُعِدَ يَوْمُكِ يا «أُمَّ خِداشَ». لَقَدْ ساوَرَنِي الْقَلَقُ عَلَيْكِ، فَماذا أَخَّرَكِ عَنْ تَحِيَّةِ صَدِيقَتِكِ؟ وَماذا تَصْنَعِينَ فَوْقَ هذا الرَّفِّ الْعالِي؟»\n" +
//     "\n" +
//     "\n" +
//     "فَقالَتْ «أُمُّ خِداشَ»: «إِنِّي مُفْضِيَةٌ إِلَيْكِ بِأَمْرٍ يَدْعُو إِلى الدَّهْشَةِ وَالْعَجَبِ: لَقَدْ فُوجِئْتُ مُفاجَآتٍ خَمْسًا، وَرَأَيْتُ غَرائِبَ خَمْسًا …!»\n" +
//     "فَلَمْ تَفْهَمْ «أُمُّ يَعْفُورَ» شَيْئًا مِمَّا تَعْنِيهِ، وَرَفَعَتْ فاها فِي الْهَواءِ وَهِيَ حائِرَةٌ، فَسَمِعَتْ صَوْتَ طِفْلٍ صَغِيرٍ يَنْبَعِثُ فَجْأَةً مِنَ الصُّنْدُوقِ مُجَمْجِمًا: «مِيا … وْ! مِيا … وْ! أُمَّاهُ!»\n" +
//     "فَأَدْرَكَتْ «أُمُّ يَعْفُورَ» السِّرَّ فِي احْتِجابِ «أُمِّ خِداشَ»، وَظَلَّتْ تَقْفِزُ في الْغُرْفَةِ، على ثَلاثِ أَرْجُلٍ، مِنْ فَرْطِ السُّرُورِ، كَما تَفْعَلُ الْكِلابُ إِذا اسْتَوْلى عَلَيْها الطَّرَبُ والْفَرَحُ. ثُمَّ هَنَّأَتْها بِهَذِه القِطاطِ الْعزيزاتِ. فقالتْ «أُمُّ خِداشَ» مزهُوَّةً فَرْحانَةً: «أَلَمْ أَقُلْ لكِ إِنَّها مُفاجآتٌ خَمْسٌ؟ نعمْ. فَإِنَّ كُلَّ واحِدٍ مِنْ هذهِ الْأَوْلادِ الْخَمْسَةِ هُوَ مُفاجَأَةٌ سارَّةٌ. فانْظُرِي بِرَبِّكِ إِلى هَذِهِ الْأُسْرَةِ الْعزيزَةِ، الَّتِي مَلَأَتْ قَلْبِي سَعادَةً وَإِعْجابًا!»\n" +
//     "وَظَلَّتْ «أُمُّ خِداشَ» تَلْحَسُ بِلِسانِها جِلْدَ أَوْلادِها الْقِطاطِ، ثُمَّ اسْتَأْنَفَتْ قائِلَةً: «آهِ لوْ تَعْلَمينَ كيفَ فُتِنْتُ بِحُبِّ هذِهِ الْأَطْفالِ الصَّغِيرَةِ! إِنَّها زِينَةُ الدُّنْيا وَبَهْجَتُها، وَمَصْدَرُ سَعادَتِنا وَمَبْعَثُ أُنْسِنا. فَهَلُمِّي — أَيَّتُها الْحَبِيبَةُ — فانْظُرِي أَطْفالِيَ الْأَعِزَّاءَ. فَإِنِّي أَعْرِفُ مِقْدارَ شَغَفِكِ بِالْأَطْفالِ، وَحَدَبِكِ عَلَيْهِمْ. هَلُمِّي فاصْعَدِي إِلَيَّ — يا «أُمَّ يَعْفُورَ» — وَتَسَلَّقِي هَذا اللَّوْحَ الصَّغِيرَ.»\n" +
//     "فوقَفَتْ «أُمُّ يَعْفُورَ» مُسْتَنِدَةً إِلى الحائطِ، وحاولَتْ أَنْ تَتَسَلَّقَ الَّلوْحَ فَلم تَسْتَطِعْ — لِصِغَرِ جِسْمِها — وَلَمْ يَصِلْ فُوها إِلى اللَّوْحِ. فقالَتْ لصاحِبَتِها: «مُحالٌ عَلَيَّ أَنْ أَصِلَ إِلى هذا اللَّوْحِ؛ فإِنَّ أُمِّيَ لَمْ تُعَلِّمْني: كَيْفَ أَتَسَلَّقُ، كَما عَلَّمَتْكِ أُمُّكِ. وَلَسْتُ أَدْرِي: ما الَّذِي حَبَّبَ إِلَيْكِ هذا الْمَكانَ الْمُرْتَفِعَ؟ أَلَمْ يَكُنْ أَحْجَى بِكِ وَأَهْدَى: أَنْ تَبْقَيْ فِي سَلَّتِكِ الَّتِي تَنامِينَ فِيها، إِلى جانِبِ سَرِيرِي؟»\n" +
//     "فَقالَتْ «أُمُّ خِداشَ»، وَهِيَ تَهُزُّ رَأْسَها مُتَعَجِّبَةً مِنْ غَفْلَةِ صَدِيقَتِها: «شَدَّ ما تُخْطِئينَ فِي حُكْمِكِ، يا «أُمَّ يَعْفُورَ». على أَنَّنِي أَلْتَمِسُ لَكِ الْعُذْرَ، لِأَنَّكِ ما تَزالِينَ طِفْلَةً، غَيْرَ مُجَرِّبَةٍ. وَأُحِبُّ أَنْ أُبَصِّرَكِ بِحَقِيقَةِ الْأَمْرِ؛ فِإِنَّ الْقِطَّةَ الذَّكِيَّةَ الْحازِمَةَ، تَرَى مِنْ واجِبِها أنْ تُخْفِيَ أبْناءَها — دائِمًا — فِي الظَّلامِ، حَتَّى لا تَقَعَ عَلَيْهِمْ عَيْنُ كائِنٍ كانَ، فِي الْأيَّامِ الْأُولَى مِنْ حَياتِهمْ. عَلى أَنَّنِي لَنْ أَبْخَلَ عَلَيْكِ بِرُؤْيِةِ واحِدٍ مِنْهُمْ، وَهُوَ أَجْمَلُهُمْ شَكْلًا، وَأَبْهاهُمْ مَنْظَرًا؛ لِأَنَّهُ مُرَقَّشٌ بِأَلْوانٍ ثَلاثَةٍ، وَلَيْسَ فِي الْقِطاطِ أَجْمَلُ مِمَّنْ يَجْمَعُ هذا الْعَدَدَ مِنَ الْأَلْوانِ. وَقَدْ أَسْمَيْتُهُ: أَبا الشَّرْقِ.»\n" +
//     "وَنَهَضَتْ «أُمُّ خِداشَ» وَوَضَعَتْ صَغِيرَها «أَبا الشَّرْقِ» على عُنُقِها — فِي خِفَّةٍ وَرَشاقَةٍ — حَتَّى لا تُزْعِجَهُ، وَقَفَزَتْ إِلَى اللَّوْحِ، وَهِيَ رافِعَةٌ رأْسَها، حَتَّى لا يَسْقُطَ مِنْها صَغِيرُها الْحَبيبُ.\n" +
//     "ثُمَّ وَضَعَتْهُ عَلى اللَّوْحِ، وَهِيَ مَزْهُوَّةٌ تائِهَةٌ بِهِ أَمامَ صَدِيقَتِها، وَقالتْ لَها: «كَيْفَ تَقُولِين؟ لا جَرَمَ أَنَّهُ جَمِيلٌ! أَلَيْسَ كَذَلِك؟»\n" +
//     "فَتَراجَعَتْ «أُمُّ يَعْفُورَ» خُطْوَةً، وَنَظَرَتْ إِلَى «أَبِي الشَّرْقِ» مَدْهُوشَةً تَعْجَبُ مِنْ رَأْسِهِ الْمُسْتَدِيرِ، وَعَيْنَيِهِ الْمُقْفَلَتَيْنِ، وَجِسْمِهِ اللَّيِّنِ، وَذنَبَه الرَّفِيعِ الَّذِي يَخْتَلِجُ.\n" +
//     "فَقالَتْ «أُمُّ خِداشَ» لِصاحِبَتِها، وَهِيَ تُرَبِّتُ — فِي رِفْقٍ وَحَنان — قِطَّتَها الصَّغِيرَةَ الْمُغْمَضَةَ الْعَيْنَيْنِ: «أَلَسْتِ تَرَيْنَهُ بَدِيعًا، يا أُمَّ يَعْفُورَ؟»\n" +
//     "\n" +
//     "\n" +
//     "فاقْتَرَبَتْ «أُمُّ يَعْفُورَ» مِنْ «أَبي الشَّرْقِ»، وَشَمَّتْهُ — وَهِيَ مُرْتَجِفَةٌ مُنْفَسِحَةُ الْأَرْجُلِ — وَقالَتْ خَجِلَةً: «لا جَرَمَ أَنَّ «أَبا الشَّرْقِ» لَطِيفٌ، وَلَعَلَّهُ يَزْدادُ جَمالًا حِينَ يَفْتَحُ عَيْنَيْهِ!»\n" +
//     "\n" +
//     "فَقالَتْ «أُمُّ خِداشَ» مَحْزُونَةً: «كَيْفَ يَزْدادُ جَمالًا؟ إِنَّه سَيَفْتَحُ عَيْنَيْهِ قَرِيبًا. أَلا تَعْرِفِينَ أَنَّ الْقِطَطَ جَميعًا — بَعْدَ أَنْ تُولَدَ — تَظَلُّ عَمْياءَ مُدَّة أَيَّامٍ ثَمانيةٍ أَوْ تِسْعَةٍ؟ عَلَى أَنَّنِي لا أَرَى وَلَدي فِي حاجَةٍ إِلَى مَزِيدٍ مِنَ الْجَمالِ، فَهُوَ عِنْدِي أَجْمَلُ ما فِي الْأَرْضِ مِنَ الْكائِناتِ. أَفاهِمَةٌ أَنْتِ ما أَقُولُ، أَيَّتُها الصَّغِيرَةُ الْغافِلَةُ؟ فِإِذا لَمْ تَفْهَمِي هَذا الْكَلامَ، وَلَمْ تُؤْمِنِي بِهِ، فِانْصَرِفِي — مِنْ فَوْرِكِ — وَلا تُرِينِي وَجْهَكِ بَعْدَ الْيَوْمِ!»\n" +
//     "ثُمَّ أَمْسَكَتْ «أُمُّ خِداشَ» بِمَوْلُودِها الْحَبيبِ، وَقَفَزَتْ إِلَى صُنْدُوقِها مُغْضَبَةً مُحْنَقَةً.\n" +
//     "وَعَجِبَتْ «أُمُّ يَعْفُورَ» مِمَّا رَأَتْ عَجَبًا شَدِيدًا. وَلَمْ تَكُنْ تَعْرِفُ — فِي صاحِبَتِها — إِلَّا دَماثَةَ الْخُلُقِ، وَلِينَ الْعَرِيكَةِ، وَلَمْ تَرَ غَضَبَها إِلَّا فِي هذا الْيَوْمِ.\n" +
//     "وَقَدْ أَدْهَشَها ما رَأَتْهُ مِنْ تَلَهُّبِ عَيْنَيْها، وَإِمْعانِها فِي إِساءَتِها وَالسُّخْطِ عَلَيْها؛ وَحَزَنَها حُزْنُ صَدِيقَتِها. ثُمَّ قالتْ لَها مُتَأَلِّمَةً: «لا عَلَيْكِ — يا عَزِيزَتِي «أُمَّ خِداشَ» — فَإنِّي لَمْ أَتَعَمَّدْ إِغْضابَكِ، وَلَمْ أَقْصِدْ إِلَى إِساءَتِكِ. وَإِنِّي مُعْتَذِرَةٌ عَمَّا فَرَطَ مِنِّي. وَسَتَرَيْنَ: كَيْفَ أُحِبُّ تِلْكَ الْقُطَيْطاتِ الْعَزِيزاتِ؟»\n" +
//     "وَلَكِنَّ «أُمَّ خِداشَ» لَمْ تَهْدَأْ ثائِرَتُها، فَقالَتْ لَها «أُمُّ يَعْفُورَ»: «وَدِدْتُ لَوْ تَعْلَمِينَ، يا صَدِيقَتِي الْعَزِيزَةَ …»\n" +
//     "فَقاطَعَتْها «أُمُّ خِداشَ» صائِحَةً: «لَسْتُ صَدِيقَةً لَكِ بَعْدَ الْيَوْمِ، وَلا أُحِبُّ أَنْ تَتَّخِذِينِي صَدِيقَةً بَعْدَ الْآنَ. فَقَدْ صَحَّ ما قالَتْهُ لِي أُمِّي: إِنَّ الْكِلابَ لا يُمْكِنُ أَنْ تُخْلِصَ فِي صَداقَتِها لِلْقِطَطِ. وَكَيْفَ تَصْفُو قُلُوبُنا، وَنَحْنُ لَمْ نُنَشَّأْ تَنْشِئَةً واحِدَةً، وَلَمْ نَدِنْ بِرَأْيٍ واحِدٍ؟»\n" +
//     "فَقالَتْ «أُمُّ يَعْفُورَ»: «لا تَنْسَيْ أَنَّنا — عَلَى ذَلِكَ — مِنْ أُسْرَةٍ واحِدَةٍ.»\n" +
//     "فَقالَتْ لَها: «لَسْتُ أَشُكُّ فِي ذَلِكَ، فَإِنَّ فَصِيلَتَنا واحِدَةٌ، لِأَنَّنا جَمِيعًا مِنْ آكِلي اللَّحْمِ، وَلكِنَّ هذِهِ الْفَصِيلَةَ تَنْقَسِمُ قِسْمَيْنِ: قِسْمًا: مُهَذَّبَ الْخُلُقِ، وَقِسْمًا: غَلِيظَ الطَّبْعِ.»\n" +
//     "فَصاحَتْ «أُمُّ يَعْفُورَ» مُعاتِبَةً: «ما أَحْسَبُكِ تَعْنِينَنِي بِهَذا التَّعْرِيضِ.»\n" +
//     "فَقالَتْ لها: «ما عَنَيْتُ سِواكِ — يا «أُمَّ يَعْفُورَ» — فَإِنَّ الْكِلابَ غَيْرُ مُهَذَّبَةٍ، وَقَدْ عَرَفَتْهُمُ الْقِطاطُ جَمِيعًا بِسُوءِ الْأدَبِ، وَغِلَظِ الطِّباعِ، وَأَنَّى لَكُمُ التَّهْذِيبُ، وَدَماثَةُ الْخُلُقِ؟ أَلَسْتُمْ أَنْتُمْ وَالثَّعالِبُ الْمَاكِرَةُ أَبْناءَ أَعْمامٍ؟ أَلَيْسَتِ الذِّئابُ الْقاسِيَةُ الْفَتَّاكَةُ — فِي الْغاباتِ — مِنْ بَناتِ أَعْمامِكُمْ الْأَدْنَيْنَ كَذَلِك؟»\n" +
//     "فَقالتْ «أُمُّ يَعْفُورَ»: «لَيْسَ مِنْ خَطَئِي — أَيَّتُها الْعَزِيزَةُ — أَنْ تَكُونَ الثَّعالِبُ وَالذِّئابُ مِنْ أَبْناءِ أَعْمامِنا، وَبَنات عَمَّاتِنا! عَلى أَنَّنِي أَذْكُرُ ما حَدَّثْتِنِي بِهِ — ذاتَ يَوْمٍ — إِذْ قَرَّرْتِ أَمامِي أَنَّ الْأَسَدَ مِنْ أَقارِبِكِ، وَهُوَ — فِيما أَعْلَمُ — وَحْشٌ ضارٍ، قاسِي الْقَلْبِ!»\n" +
//     "فَقالتْ «أُمُّ خِداشَ»: «لَسْتُ أُنْكِرُ هَذا، فَإِنَّ السَّبُعَ هُو ابْنُ عَمِّي بِلا شَك. وِإنِّي بِذَلِك لَفَخُورَةٌ مَزْهُوَّةٌ؛ لِأَنَّهُ نَبِيلٌ عَظِيمٌ، بَعِيدُ الْهِمَّةِ، عَزِيزُ النَّفْسِ، وَهُوَ مَلِكُ الْحَيَوانِ، وَسيِّدُنا الْآمِرُ الْمُطاعُ. وَنَحْنُ مِنَ الْأُمَراءِ، لِأَنَّنا مِنْ تِلْكَ الْأُسْرَةِ الْمُلُوكِيَّةِ السَّامِيَةِ. فَلا غَرْوَ إِذا دانَ لَنا النَّاسُ بِالِاحْتِرامِ وَالإِجْلالِ، فَلَمْ يُطَوِّقُوا أَعْناقَنا بِالسَّلاسِلِ وَالْأَطْواقِ، كَما يَفْعَلُونَ مَعَكُمْ، مَعْشَرَ الْكِلابِ؛ لِأَنَّنا وُلِدْنا وَعِشْنا أَحْرارًا، لا سُلْطانِ لِأَحَدٍ عَلَيْنا!»\n" +
//     "\n" +
//     "\n" +
//     "وَكَأَنَّما ضَجِرَتِ الْقُطَيْطاتُ الصَّغِيراتُ بِهذا الْحِوارِ الطَّويلِ، فَانْبَعَثَ مُواؤُها خافِتًا مِنْ قاعِ الصُّنْدُوقِ. فَمالتْ «أُمُّ خِداشَ» إِلى أَطْفالِها، وَقَدْ اضْطَجَعَتْ عَلى جانِبِها، وَفَسَحَتْ أَرْجُلَها، وَجَمْجَمَتْ قَلِيلًا. فَسَكَتَ صِغارُها، وَمَدُّوا أَلْسِنَتَهُمْ باحِثِينَ عَنْ ثُدِيِّ أُمِّهِم — يَمْنَةً وَيَسْرَةً — وَظَلَّتْ أَلْسِنَتُهُمُ الْوَرْدِيَّةُ الصَّغِيرَةُ تُطَقْطِقُ بِصَوْتٍ خافِتٍ، وَظَلَّتْ أُمُّهُمْ تَلْحَسُهُمْ، وَهُمْ يَرْضَعُونَ، وَهِيَ حانِيةٌ عَلَيْهِمْ. ثُمَّ قالَتْ تُداعِبُ «أَبا الشَّرْقِ»: «يا لَكَ مِنْ شَرِهٍ! لَقَدْ ظَلِلْتَ تَطْعَمُ عَشْرَ دَقائِقَ كامِلَةً، دُونَ أَنْ تَشْبَعَ! أَلا تَتْرُكُ ثَدْيِي لِإِخْوَتِكَ الْآخَرِين؟ إِنَّ أُخْتَكَ الْمِسْكِينَةَ «أُمَّ الشَّرْقِ» نَحِيلَةٌ مَهْزُولَةُ الْجِسْمِ؛ وَقَدْ هَمَّنِي ضَعْفُها، وَأَقْلَقَ بالِي، فَهِيَ لَمْ تَنْطِقْ بِكَلِمَةٍ واحِدَةٍ، مُنْذُ وِلادَتِها إِلى الْآن. وَهِيَ لَيستْ بَكْماءَ فِيما أَرى. فَما سِرُّ ضَعْفِها وَهُزالِها؟ شَدَّ ما يُزْعِجُ الْأُمَّاتِ مَرَضُ أَبنائِهِنَّ!»";
// let pList1 = chapAll.trim().split(/\n+/g);

// let sList = gpt.getSentences(chap);
// let sChunk = sList.join(" ");
// let sSpaced = sList.join("\n\n");

// const delay = ms => new Promise(res => setTimeout(res, ms));

// await gpt.translateParagraph(chapAll);
// console.log("finished");
