import {Translator} from "./translator.js"
import fetch from "node-fetch";

let translator = new Translator()
await translator.init()


let s1 = "فَأَدْرَكَتْ «أُمُّ يَعْفُورَ» السِّرَّ فِي احْتِجابِ «أُمِّ خِداشَ»، وَظَلَّتْ تَقْفِزُ في الْغُرْفَةِ، على ثَلاثِ أَرْجُلٍ، مِنْ فَرْطِ السُّرُورِ، كَما تَفْعَلُ الْكِلابُ إِذا اسْتَوْلى عَلَيْها الطَّرَبُ والْفَرَحُ."

let s2 = "ثُمَّ جَلَسَتْ «أُمُّ يَعْفُورَ» عَلَى رِجْلَيْها الْخَلْفِيَّتَيْنِ، وظلَّتْ تَسْتَنْشِقُ بُخارَ الْحَساءِ المُتَصاعِدَ بفِيها الأَسْوَدِ، وتَتَأَمَّلُ في الصَّحْفَةِ، وَهِيَ تَقُوُلُ لنَفْسِها: «لَقَدْ ذَكَرْتُ الْآنَ كُلَّ شَيْءٍ!"

let s3 = "ناسِها وَحَيَوانِها، تُفَكِّرُ فِيما يَعُودُ عَلَيْهِمْ بِالنَّفْعِ، وَتَعْمَلُ عَلَى دَفْعِ أَسْبابِ الشَّرِّ والْأَذَى عَنْهُمْ، وَتَحْمِلُ هَمَّ الصَّغِيرِ والْكَبِيرِ مِنْهُمْ عَلَى السَّواءِ."

let s4 = "«دَحْدَاحٌ» حَضَرَ لِمُقَابَلَةِ جَدِّهِ «أَبِي نَبْهَانَ»، فَقَالَ لَهُ الْجَدُّ: «هَذَا مَنْشُورٌ، فِيهِ تَجَارِبِي وَخِبْرَاتِي، هِيَ دُسْتُورٌ لِلْأَرَانِبِ."

let s5 = "فَتَراجَعَتْ «أُمُّ يَعْفُورَ» خُطْوَةً، وَنَظَرَتْ إِلَى «أَبِي الشَّرْقِ» مَدْهُوشَةً تَعْجَبُ مِنْ رَأْسِهِ الْمُسْتَدِيرِ، وَعَيْنَيِهِ الْمُقْفَلَتَيْنِ، وَجِسْمِهِ اللَّيِّنِ، وَذنَبَه الرَّفِيعِ الَّذِي يَخْتَلِجُ."

let s6 = "فَقالَتْ لها: «ما عَنَيْتُ سِواكِ — يا «أُمَّ يَعْفُورَ» — فَإِنَّ الْكِلابَ غَيْرُ مُهَذَّبَةٍ، وَقَدْ عَرَفَتْهُمُ الْقِطاطُ جَمِيعًا بِسُوءِ الْأدَبِ، وَغِلَظِ الطِّباعِ، وَأَنَّى لَكُمُ التَّهْذِيبُ، وَدَماثَةُ الْخُلُقِ؟"

let s7 = "وَرَآهُ «هِبَةُ اللهِ»، وَهُوَ يَتَحَفَّزُ للانْتِقامِ، فعَاجَلَهُ بِضَرْبَةٍ ثانِيَةٍ، بَتَرَتْ (قَطَعَتْ) يُمْناهُ، فَهَوَتْ إلَى الأرْضِ، وَفي قَبْضَتِها سَيْفُهُ.";

let testStrings = [
    "فَأَدْرَكَتْ «أُمُّ يَعْفُورَ» السِّرَّ فِي احْتِجابِ «أُمِّ خِداشَ»، وَظَلَّتْ تَقْفِزُ في الْغُرْفَةِ، على ثَلاثِ أَرْجُلٍ، مِنْ فَرْطِ السُّرُورِ، كَما تَفْعَلُ الْكِلابُ إِذا اسْتَوْلى عَلَيْها الطَّرَبُ والْفَرَحُ.",
    "ثُمَّ جَلَسَتْ «أُمُّ يَعْفُورَ» عَلَى رِجْلَيْها الْخَلْفِيَّتَيْنِ، وظلَّتْ تَسْتَنْشِقُ بُخارَ الْحَساءِ المُتَصاعِدَ بفِيها الأَسْوَدِ، وتَتَأَمَّلُ في الصَّحْفَةِ، وَهِيَ تَقُوُلُ لنَفْسِها: «لَقَدْ ذَكَرْتُ الْآنَ كُلَّ شَيْءٍ!",
    "ناسِها وَحَيَوانِها، تُفَكِّرُ فِيما يَعُودُ عَلَيْهِمْ بِالنَّفْعِ، وَتَعْمَلُ عَلَى دَفْعِ أَسْبابِ الشَّرِّ والْأَذَى عَنْهُمْ، وَتَحْمِلُ هَمَّ الصَّغِيرِ والْكَبِيرِ مِنْهُمْ عَلَى السَّواءِ.",
    "«دَحْدَاحٌ» حَضَرَ لِمُقَابَلَةِ جَدِّهِ «أَبِي نَبْهَانَ»، فَقَالَ لَهُ الْجَدُّ: «هَذَا مَنْشُورٌ، فِيهِ تَجَارِبِي وَخِبْرَاتِي، هِيَ دُسْتُورٌ لِلْأَرَانِبِ.",
    "فَتَراجَعَتْ «أُمُّ يَعْفُورَ» خُطْوَةً، وَنَظَرَتْ إِلَى «أَبِي الشَّرْقِ» مَدْهُوشَةً تَعْجَبُ مِنْ رَأْسِهِ الْمُسْتَدِيرِ، وَعَيْنَيِهِ الْمُقْفَلَتَيْنِ، وَجِسْمِهِ اللَّيِّنِ، وَذنَبَه الرَّفِيعِ الَّذِي يَخْتَلِجُ.",
    "فَقالَتْ لها: «ما عَنَيْتُ سِواكِ — يا «أُمَّ يَعْفُورَ» — فَإِنَّ الْكِلابَ غَيْرُ مُهَذَّبَةٍ، وَقَدْ عَرَفَتْهُمُ الْقِطاطُ جَمِيعًا بِسُوءِ الْأدَبِ، وَغِلَظِ الطِّباعِ، وَأَنَّى لَكُمُ التَّهْذِيبُ، وَدَماثَةُ الْخُلُقِ؟",
    "وَرَآهُ «هِبَةُ اللهِ»، وَهُوَ يَتَحَفَّزُ للانْتِقامِ، فعَاجَلَهُ بِضَرْبَةٍ ثانِيَةٍ، بَتَرَتْ (قَطَعَتْ) يُمْناهُ، فَهَوَتْ إلَى الأرْضِ، وَفي قَبْضَتِها سَيْفُهُ.",
];


let t;
for (let i = 0; i < testStrings.length; i++) {
    t = await translator.gTranslateSentence(testStrings[i]);
    console.log(t);
}

