import {Translator} from "./translator.js"
import fetch from "node-fetch";

let translator = new Translator()
await translator.init()

let testStrings = [
    "فَأَدْرَكَتْ «أُمُّ يَعْفُورَ» السِّرَّ فِي احْتِجابِ «أُمِّ خِداشَ»، وَظَلَّتْ تَقْفِزُ في الْغُرْفَةِ، على ثَلاثِ أَرْجُلٍ، مِنْ فَرْطِ السُّرُورِ، كَما تَفْعَلُ الْكِلابُ إِذا اسْتَوْلى عَلَيْها الطَّرَبُ والْفَرَحُ.",
    "ثُمَّ جَلَسَتْ «أُمُّ يَعْفُورَ» عَلَى رِجْلَيْها الْخَلْفِيَّتَيْنِ، وظلَّتْ تَسْتَنْشِقُ بُخارَ الْحَساءِ المُتَصاعِدَ بفِيها الأَسْوَدِ، وتَتَأَمَّلُ في الصَّحْفَةِ، وَهِيَ تَقُوُلُ لنَفْسِها: «لَقَدْ ذَكَرْتُ الْآنَ كُلَّ شَيْءٍ!",
    "ناسِها وَحَيَوانِها، تُفَكِّرُ فِيما يَعُودُ عَلَيْهِمْ بِالنَّفْعِ، وَتَعْمَلُ عَلَى دَفْعِ أَسْبابِ الشَّرِّ والْأَذَى عَنْهُمْ، وَتَحْمِلُ هَمَّ الصَّغِيرِ والْكَبِيرِ مِنْهُمْ عَلَى السَّواءِ.",
    "«دَحْدَاحٌ» حَضَرَ لِمُقَابَلَةِ جَدِّهِ «أَبِي نَبْهَانَ»، فَقَالَ لَهُ الْجَدُّ: «هَذَا مَنْشُورٌ، فِيهِ تَجَارِبِي وَخِبْرَاتِي، هِيَ دُسْتُورٌ لِلْأَرَانِبِ.",
    "فَتَراجَعَتْ «أُمُّ يَعْفُورَ» خُطْوَةً، وَنَظَرَتْ إِلَى «أَبِي الشَّرْقِ» مَدْهُوشَةً تَعْجَبُ مِنْ رَأْسِهِ الْمُسْتَدِيرِ، وَعَيْنَيِهِ الْمُقْفَلَتَيْنِ، وَجِسْمِهِ اللَّيِّنِ، وَذنَبَه الرَّفِيعِ الَّذِي يَخْتَلِجُ.",
    "فَقالَتْ لها: «ما عَنَيْتُ سِواكِ — يا «أُمَّ يَعْفُورَ» — فَإِنَّ الْكِلابَ غَيْرُ مُهَذَّبَةٍ، وَقَدْ عَرَفَتْهُمُ الْقِطاطُ جَمِيعًا بِسُوءِ الْأدَبِ، وَغِلَظِ الطِّباعِ، وَأَنَّى لَكُمُ التَّهْذِيبُ، وَدَماثَةُ الْخُلُقِ؟",
    "وَرَآهُ «هِبَةُ اللهِ»، وَهُوَ يَتَحَفَّزُ للانْتِقامِ، فعَاجَلَهُ بِضَرْبَةٍ ثانِيَةٍ، بَتَرَتْ (قَطَعَتْ) يُمْناهُ، فَهَوَتْ إلَى الأرْضِ، وَفي قَبْضَتِها سَيْفُهُ.",
    "وَانْتَهى بِها الْمَطافُ إِلى غُرْفَةِ الغُسْلِ الصَّغِيرَةِ، فَبَصْبَصَتْ (حَرَّكَتْ ذنَبها) مَسْرُورَةً بِتَوْفِيقِها، وَرَفَعَتْ عَيْنَيْها إِلى صُنْدُوقٍ فَوْقَ الرَّفِّ، ثُمَّ حَيَّتْ صَديقَتَها مُبْتَهِجَةً، قائِلَةً: «سُعِدَ يَوْمُكِ يا «أُمَّ خِداشَ».",
    "وَكان نَوْمُها — في تلك الَّليلةِ — مُضْطَرِبًا، فَقَدِ ارْتَجَفَ جِسْمُها — فِي أَثْناءِ النَّومِ — واضْطرب ذَيْلُها، وَظَلَّ يَضْرِبُ الْأَرْضَ، وَتَصاعَدَتْ زَفَراتُها وَأَنَّاتُها مِنَ الْأَلَمِ.",
    "وَلا زالَ الأَشْرارُ — فِي كُلِّ زَمَنٍ — مُولَعِينَ بالإِساءَةِ إِلَى الْأَخْيارِ، بِكُلِّ ما وَسِعَتْهُ نُفُوسُهُمُ الوَضِيعَةُ، مِنْ دَسائِسَ وَأَذِيَّاتٍ، وَمَكايِدَ وَإِساءاتٍ.",
    "فَلَمْ يَثْنِ ذلِكَ مِنْ عَزْمِ «هِبَةِ اللهِ»، وَأَجابَها، في غَيْرِ تَرَدُّدٍ: «سِيَّانِ عِنْدِي — يا أُمَّاهُ — أَنْ يُفَكِّرَ أَبِي فِي أَمْرِي، أَوْ لا يُفَكِّرَ؛",
    "أَجابَتْ «لاحِظَةُ»: «لَيْسَتِ الشَّجاعَةُ أَنْ تَرْمِي بِنَفْسِكِ فِي الْمَهالِكِ، وَلكِنَّ الشَّجاعَةَ أَنْ تَتَّخِذِي لِكُلِّ أَمْرٍ عُدَّتَهُ، وَتَعْرِفِي الْوَسِيلَةَ الَّتِي تُمَكِّنُكِ مِنْ بُلُوغِ الْغَرَضِ، دُونَ أَنْ يَنالَكِ مَكْرُوهٌ، أَوْ أَنْ يُصِيبَكِ أَقَلُّ أَذًى.",
    "قالَتْ «لاحِظَةُ» وَهِيَ تُرَبِّتُ كَتِفَ الْفَتاةِ: «أَرْعِينِي سَمْعَكِ، لِكَيْ تَتَفَهَّمِي فَحْوَى قَوْلِي، يا بُنَيَّتِي: يَجِبُ أَنْ تَقْضِي مَعِي بَعْدَ ذلِكَ شَهْرَيْنِ كامِلَيْنِ، أُعَلِّمُكِ — فِي خِلالِهِما — لُغَةَ الْغِرْبانِ والضَّفادِعِ.",
    "لِسَانُهُ جَعَلَ يُرَدِّدُ كَلِمَاتِ النَّشِيدِ الَّذِي وَضَعَهُ جَدُّهُ، وَسَأَلَ نَفْسَهُ: «لِمَاذَا يَحْرِصُ جَدِّي كُلَّ هَذَا الْحِرْصِ عَلَى تَخْوِيفِنَا مِنَ الصَّيَّادِ؟",
    "بَعْدَ أَنْ كَمَنَ في مُنْتَصَفِ طَرِيقِهِمْ إلى حاضِرَةِ أَبِيهِ، وَفاجَأَهُمْ — مِنْ حَيْثُ لا يَتَوَقَّعُونَ — مفاجَأَةً صاعِقَةً، قَذَفَتِ الرُّعْبَ في قُلُوبِهِم، وأَوْقَعَتِ الخَلَلَ بَيْنَ صُفُوفِهِم.",
    " أَمَّا أَهْلُكِ فَسَيَذْكُرُونَكِ بِالْخَيْرِ، وَيَعُدُّونَكِ مَثَلًا لِلشَّجاعَةِ والْإِقْدامِ والْفِداءِ، إِذْ يَحْسَبُونَ أَنَّكِ اقْتَحَمْتِ عَلَى الْأَسَدِ عَرِينَهُ، سَتَكُونِينَ بَيْنَهُمْ بِرُوحِكِ هذِهِ الْأَشْهُرَ الثَّلاثَةَ … ثُمَّ تَكُونُ الْمُفاجَأَةُ السَّارَّةُ حِينَ يَلْقَوْنَكِ بَعْدَ الْغِيابِ!"
];


// let t;
// for (let i = 0; i < testStrings.length; i++) {
//     t = await translator.gTranslateSentence(testStrings[i]);
//     console.log(t);
// }

// t = await translator.gTranslateSentence(testStrings[1]);
// console.log(t);

// t = await translator.gTranslateSentence(testStrings.slice(-1)[0]);
// console.log(t);

// let w1 =  "تَجْري";
// let t1 = await translator.translateArabicWord(w1);
// console.log(t1);

// let w2 = "تَخَافُ";
// let t2 = await translator.translateArabicWord(w2);
// console.log(t2);



// let w3 =  "تَأْكُلَهَا";
// let t3 = await translator.translateArabicWord(w3);
// console.log(t3);

let w4 =  "تَلْحَقَهُ";
let t4 = await translator.translateArabicWord(w4);
console.log(t4);